src/Catalogs/Scan_Изделия/Scan_Изделия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_Изделия</name>
  <attributes>
    <name>DLV</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDExternalSystem</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDExternalSystemProduct</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDПродуктаКП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VIN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VIN2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аренда</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаИзделийOFMS</name>
    <type>
      <types>EnumRef.Scan_ГруппыИзделийOFMS</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИстеченияПолиса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДействияПолиса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУстановки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Демо</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДемоИТест</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДилерНакладнаяУТ</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорСКлиентомНакладнаяУТ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументУстановкиПлановыхЦенПродукта</name>
    <type>
      <types>DocumentRef.Scan_УстановкаПлановыхЦенПродукта</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказНаЗавод</name>
    <type>
      <types>CatalogRef.Scan_ЗаказыНаЗавод</types>
    </type>
  </attributes>
  <attributes>
    <name>Замечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗапрашиваемоеМестоПередачи</name>
    <type>
      <types>CatalogRef.Scan_Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретИзмененияСкладаПродажи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КлиентНакладнаяУТ</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КлиентПродукта</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КлиентСоглашенияОПоставке</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДилера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КрайняяДатаУстраненияНедостатков</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛокальныйСтатусПродукта</name>
    <type>
      <types>CatalogRef.Scan_ЛокальныеСтатусыПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>МаркаПродукта</name>
    <type>
      <types>CatalogRef.Scan_МаркиПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоПередачи</name>
    <type>
      <types>CatalogRef.Scan_Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоПроизводства</name>
    <type>
      <types>CatalogRef.Scan_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>МодельДвигателяТС</name>
    <type>
      <types>CatalogRef.Scan_МоделиПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>МодельПродукта</name>
    <type>
      <types>CatalogRef.Scan_МоделиПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>МодельПТС</name>
    <type>
      <types>CatalogRef.Scan_МоделиПоПТС</types>
    </type>
  </attributes>
  <attributes>
    <name>Надстр_Поставщик</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НеОбновлятьЛогистическиеТипыИз1БД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеОбновлятьМоделиИз1БД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеРазрешеноМенятьСрокУстраненияНедостатков</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДвигателяТС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерИзделия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерКП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПолисаОСАГО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПТС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЭРАГЛОНАСС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортОтправки</name>
    <type>
      <types>CatalogRef.Scan_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПортПрихода</name>
    <type>
      <types>CatalogRef.Scan_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродавецПродукта</name>
    <type>
      <types>CatalogRef.Scan_КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>СебестоимостьЛогистическая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СегментРынкаПродуктов</name>
    <type>
      <types>CatalogRef.Scan_СегментыРынкаПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПродажи</name>
    <type>
      <types>CatalogRef.Scan_Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СоглашениеОПоставке</name>
    <type>
      <types>CatalogRef.Scan_СоглашенияОПоставке</types>
    </type>
  </attributes>
  <attributes>
    <name>СозданВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СОП</name>
    <type>
      <types>CatalogRef.Scan_ДоговорыВзаиморасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>СпецификацияПродукта</name>
    <type>
      <types>CatalogRef.Scan_СпецификацииПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокУстраненияНедостатковДоп</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтандартнаяСпецификация</name>
    <type>
      <types>DocumentRef.Scan_СпецификацияСтандартнойМодели</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьПродажи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьПродажиБУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьПродажиБУБезНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьПродажиБУСтавкаНДС</name>
    <type>
      <types>CatalogRef.Scan_СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТахографСЗаводаСкания</name>
    <type>
      <types>CatalogRef.Scan_ВидыТахографов</types>
    </type>
  </attributes>
  <attributes>
    <name>Тест</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипГИБДД</name>
    <type>
      <types>CatalogRef.Scan_ТипыГИБДД</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКабины</name>
    <type>
      <types>CatalogRef.Scan_ТипыКабинИзделий</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКузова</name>
    <type>
      <types>CatalogRef.Scan_ТипыКузова</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПродукта</name>
    <type>
      <types>CatalogRef.Scan_ТипыПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПродуктаЛогистический</name>
    <type>
      <types>CatalogRef.Scan_ТипыПродуктовЛогистика</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСпецификации</name>
    <type>
      <types>EnumRef.Scan_ТипыСпецификации</types>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипТопливаДвигателя</name>
    <type>
      <types>CatalogRef.Scan_ТипыТопливаДвигателейПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТСПоПТС</name>
    <type>
      <types>CatalogRef.Scan_ТипыТСПоПТС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипыМаркетинговые</name>
    <type>
      <types>CatalogRef.Scan_МаркетинговыеТипыПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>УстановленныйТахограф</name>
    <type>
      <types>CatalogRef.Scan_ВидыТахографов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветКабиныПТС</name>
    <type>
      <types>CatalogRef.Scan_ЦветаКабиныПТС</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭкологическийКласс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭПТС</name>
    <type>
      <types>CatalogRef.Scan_ЭПТС</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭраГлонассАктивирована</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Scan_Изделия/Forms/ФормаВыбора/Module.bsl
//rarus ozhnik 15888 19.05.2020 + 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Модель") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"МодельПродукта", Параметры.Модель,ВидСравненияКомпоновкиДанных.Равно, "Модель продукта",	,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный ,);//rarus agar 13.04.2021 17622 +-
	КонецЕсли;
	Если Параметры.Свойство("БУ") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"БУ", ложь,ВидСравненияКомпоновкиДанных.Равно,	,	,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный ,);
	КонецЕсли;
	Если Параметры.Свойство("ПустоеСоглашениеОПоставке") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"СоглашениеОПоставке", Справочники.Scan_СоглашенияОПоставке.ПустаяСсылка(),ВидСравненияКомпоновкиДанных.Равно, "Заявка",	,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный ,);//rarus agar 13.04.2021 17622 +-
	КонецЕсли;
	
	//rarus agar 13.04.2021 17622 ++
	ОтображениеФиксированногоОтбора();
	//rarus agar 13.04.2021 17622 --
	
КонецПроцедуры

//rarus agar 13.04.2021 17622 ++
&НаСервере
Процедура ОтображениеФиксированногоОтбора()
	
	ПредставлениеОбъекта = Метаданные.Справочники.Scan_Изделия.ПредставлениеОбъекта;
	ПредставлениеОтбора  = Scan_ВспомогательныеФункцииСервер.ПолучитьПредставлениеОтбораФормыВыбора(ЭтотОбъект, ПредставлениеОбъекта);
	
	Если Не ПустаяСтрока(ПредставлениеОтбора) Тогда
		ФиксированныйОтборПредставление = ПредставлениеОтбора;
		
		Элементы.ФиксированныйОтборПредставление.Видимость = Истина;
		Элементы.ФиксированныйОтборПредставление.Высота    = СтрЧислоСтрок(ПредставлениеОтбора);
	КонецЕсли;
	
КонецПроцедуры
//rarus agar 13.04.2021 17622 --

//rarus ozhnik 15888 19.05.2020 - 
//rarus tenkam 04.10.2019 mantis 14442 +++

////rarus tenkam 03.06.2016 mantis 7009 ++
//&НаСервере
//Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
//	Если Параметры.Свойство("ТолькоПрицепы") Тогда
//		
//		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТипПродукта.ВидПродукта.ГруппаПродукта");
//		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
//		ЭлементОтбора.Использование = Истина;
//		ЭлементОтбора.ПравоеЗначение = Справочники.Scan_ГруппыПродуктов.ТранспортныеСредства;
//		Если Параметры.ТолькоПрицепы Тогда
//			
//			ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТипПродукта.ВидПродукта.Родитель");
//			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
//			ЭлементОтбора.Использование = Истина;
//			ЭлементОтбора.ПравоеЗначение = Справочники.Scan_ВидыПродуктов.ПрицепнаяТехника;
//			
//		Иначе
//			
//			ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТипПродукта.ВидПродукта.Родитель");
//			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
//			ЭлементОтбора.Использование = Истина;
//			ЭлементОтбора.ПравоеЗначение = Справочники.Scan_ВидыПродуктов.ПрицепнаяТехника;
//			
//		КонецЕсли;
//	КонецЕсли;
//	//rarus sergei 06.07.2016 mantis 6929 ++
//	// не актуально после 7029, теперь отбор устанавливается по продукту
//	//Если Параметры.Свойство("ВидСравненияВСписке") Тогда
//	//	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	//	
//	//	
//	//	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
//	//	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
//	//	ЭлементОтбора.Использование = Истина;
//	//	ЭлементОтбора.ПравоеЗначение = ПолучитьПродуктыПоКарточкам();

//	//КонецЕсли;
//	//rarus sergei 06.07.2016 mantis 6929 --

//	
//КонецПроцедуры
////rarus tenkam 03.06.2016 mantis 7009 --
//rarus tenkam 04.10.2019 mantis 14442 ---


//rarus sergei 06.07.2016 mantis 6929 ++

//&НаСервере
//Функция ПолучитьПродуктыПоКарточкам()
//	
//	//Запрос = Новый Запрос;
//	//Запрос.Текст = "ВЫБРАТЬ
//	//               |	Scan_ВзаимосвязьПродуктовИКарточекЗаказов.Продукт
//	//               |ИЗ
//	//               |	РегистрСведений.Scan_ВзаимосвязьПродуктовИКарточекЗаказов КАК Scan_ВзаимосвязьПродуктовИКарточекЗаказов";
//	//ПродуктыПоКарточкам = Запрос.Выполнить().Выгрузить();
//	СписокПродуктовПоКарточкам = Новый СписокЗначений;
//	//Для каждого Элемент Из ПродуктыПоКарточкам Цикл
//	//
//	//	СписокПродуктовПоКарточкам.Добавить(Элемент.Продукт);	
//	//
//	//КонецЦикла; 
//	
//	Возврат СписокПродуктовПоКарточкам;
//КонецФункции
//rarus sergei 06.07.2016 mantis 6929 --
